[
    {
        "name": "Genji",
        "description": "The cyborg ninja Genji Shimada has made peace with the augmented body he once rejected, and in doing so, he has discovered a higher humanity.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/genji/hero-select-portrait.png"
    },
    {
        "name": "Cassidy",
        "description": "Armed with his Peacekeeper revolver, Cassidy takes out targets with deadeye precision and dives out of danger with eagle-like speed.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/cassidy/hero-select-portrait.png"
    },
    {
        "name": "Pharah",
        "description": "Having come from a long line of highly decorated soldiers, Pharah's commitment to duty and honor runs in her blood. She soars through the air in her Raptora combat suit, armed with a launcher that bombards enemies with high-explosive rockets.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/pharah/hero-select-portrait.png"
    },
    {
        "name": "Reaper",
        "description": "Reaper is deadly shotgun-wielding assassin with the ability to move around the battlefield like a ghost. Wherever he appears, death follows.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/reaper/hero-select-portrait.png"
    },
    {
        "name": "Soldier: 76",
        "description": "Armed with cutting-edge weaponry, including an experimental pulse rifle that’s capable of firing spirals of high-powered rockets, Soldier: 76 has the speed and support know-how of a highly trained warrior.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/soldier-76/hero-select-portrait.png"
    },
    {
        "name": "Tracer",
        "description": "The Overwatch agent known as Tracer is a time-jumping adventurer and an irrepressible force for good. Toting twin pulse pistols and time bombs, Tracer is able to 'blink' through space and rewind her personal timeline as she battles to right wrongs the world over.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/tracer/hero-select-portrait.png"
    },
    {
        "name": "Bastion",
        "description": "Once a frontline combatant in the devastating Omnic Crisis, this curious Bastion unit is fascinated by nature but wary of a fearful humanity. His ability to transform between configurations makes him a versatile ally .",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/bastion/hero-select-portrait.png"
    },
    {
        "name": "Hanzo",
        "description": "A skilled bowman and assassin equipped with a quiver of enhanced arrows, Hanzo Shimada strives to prove himself as a warrior without peer.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/hanzo/hero-select-portrait.png"
    },
    {
        "name": "Junkrat",
        "description": "Armed with a frag launcher and area-denying armaments, Junkrat is an explosives-obsessed Junker who lives to cause chaos and destruction.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/junkrat/hero-select-portrait.png"
    },
    {
        "name": "Mei",
        "description": "Mei is a scientist with an arsenal of weather-altering devices. Formerly a researcher, she has joined Winston to help Overwatch face the new threats facing the world.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/mei/hero-select-portrait.png"
    },
    {
        "name": "Torbjörn",
        "description": "Overwatch once possessed one of the most advanced armaments on the planet, thanks to Torbjörn. His extensive arsenal includes a rivet gun, hammer, and a personal forge that he can use to build turrets.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/torbjorn/hero-select-portrait.png"
    },
    {
        "name": "Widowmaker",
        "description": "Widowmaker is the perfect assassin, armed with a precise rifle, venom mines, and the ability to grapple to sniping spots in the blink of an eye.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/widowmaker/hero-select-portrait.png"
    },
    {
        "name": "D.Va",
        "description": "Once a professional gamer, D.Va now utilizes her nimble reflexes and quick thinking to pilot a state-of-the-art mech in defense of her homeland.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/dva/hero-select-portrait.png"
    },
    {
        "name": "Reinhardt",
        "description": "Reinhardt is champion who lives by the knightly codes of valor, justice, and courage. Clad in powered armor and swinging his hammer, he leads a rocket-propelled charge across the battleground and defends his comrades with a massive energy barrier.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/reinhardt/hero-select-portrait.png"
    },
    {
        "name": "Roadhog",
        "description": "Roadhog is a durable killer with a Scrap Gun that’'s devastating at close range. Few enemies can escape him and his fearsome hook.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/roadhog/hero-select-portrait.png"
    },
    {
        "name": "Winston",
        "description": "A super-intelligent, genetically engineered gorilla, Winston is a brilliant scientist and a champion for humanity''s potential. He wields impressive inventions—a jump pack, electricity-blasting Tesla Cannon, portable shield projector, and more—with literal gorilla strength.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/winston/hero-select-portrait.png"
    },
    {
        "name": "Zarya",
        "description": "Zarya is one of the world's strongest women, a celebrated athlete who sacrificed personal glory to face the mechanical foes threatening her people. Armed with a powerful beam weapon and an arsenal of protective shields, Zarya excels in frontline combat.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/zarya/hero-select-portrait.png"
    },
    {
        "name": "Ana",
        "description": "One of the founding members of Overwatch, Ana uses her skills and expertise to defend her home and the people she cares for. Equipped with a versatile arsenal, she wields her sniper rifle to aid allies and damage enemies from across the battlefield.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/ana/hero-select-portrait.png"
    },
    {
        "name": "Lúcio",
        "description": "Lúcio is an international celebrity who inspires social change through his music and actions. On the battlefield, he utilizes his cutting-edge Sonic Amplifier and unique songs to assail enemies, heal allies, and boost his teammates’ speed.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/lucio/hero-select-portrait.png"
    },
    {
        "name": "Mercy",
        "description": "A guardian angel to those who come under her care, Mercy is a peerless healer, a brilliant scientist, and a staunch advocate for peace. Her Valkyrie Suit helps keep her close to teammates, enabling her to heal, resurrect, or strengthen them with her Caduceus Staff.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/mercy/hero-select-portrait.png"
    },
    {
        "name": "Symmetra",
        "description": "A Vishkar architech, Symmetra uses light to reshape her reality. She forms turrets to disrupt her foes, teleporters to move her allies, and an protective hard-light barrier to control the flow of combat.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/symmetra/hero-select-portrait.png"
    },
    {
        "name": "Zenyatta",
        "description": "Zenyatta is an omnic monk who wanders the world in search of spiritual enlightenment. Wielding mysterious and powerful orbs, he heals allies and weakens enemies.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/zenyatta/hero-select-portrait.png"
    },
    {
        "name": "Orisa",
        "description": "Rebuilt from an OR15 defense robot by Efi Oladele, Orisa has grown into the defender of her home city of Numbani. Her fortified armor, energy javelin, and augmented fusion driver make her a force to be reckoned with.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/orisa/hero-select-portrait.png"
    },
    {
        "name": "Sombra",
        "description": "One of the world''s most notorious hackers, Sombra uses information to manipulate those in power. Her stealthy abilities and debilitating attacks make her a powerful infiltrator, as well as a hard target to pin down.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/sombra/hero-select-portrait.png"
    },
    {
        "name": "Ashe",
        "description": "The leader of the Deadlock Gang and a respected figure in the criminal underworld, Ashe deals with battlefield business by her own set of rules. She packs an explosive amount of firepower with two guns, a steady supply of dynamite, and a direct line to her trusty butler Bob.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/ashe/hero-select-portrait.png"
    },
    {
        "name": "Baptiste",
        "description": "Baptiste wields an assortment of experimental devices and weaponry to keep allies alive and eliminate threats under fierce conditions. A battle-hardened combat medic, he is just as capable of saving lives as he is of taking out the enemy.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/baptiste/hero-select-portrait.png"
    },
    {
        "name": "Brigitte",
        "description": "Brigitte Lindholm has taken up arms to defend those in need of protection. She specializes in close-range attacks that heal and protect her nearby allies.",
        "role": "Support",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/brigitte/hero-select-portrait.png"
    },
    {
        "name": "Doomfist",
        "description": "Recently freed from imprisonment, Doomfist is determined to plunge the world into a new conflict that he believes will make humanity stronger. His cybernetics make him a powerful and highly-mobile frontline fighter capable of dealing ranged damage, knocking enemies into the air, and charging boldly into the fray.",
        "role": "Tank",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/doomfist/hero-select-portrait.png"
    },
    {
        "name": "Echo",
        "description": "Echo is an evolutionary robot programmed with rapidly adapting artificial intelligence and flight capability, versatile enough to fill multiple battlefield combat roles.",
        "role": "DPS",
        "image": "https://blzgdapipro-a.akamaihd.net/hero/echo/hero-select-portrait.png"
    },
    {
        "name": "Junker Queen",
        "description": "The Junker Queen is the uncontested ruler of the chaotic city of Junkertown. Armed with a shotgun, her knife Gracie, and her axe Carnage, she delights in wreaking havoc on the front line of battle.",
        "role": "Tank",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/cef2406b2244b80506f83b8fb9ebaf214f41fa8795cbeef84026cd8018561d04.png"
    },
    {
        "name": "Kiriko",
        "description": "Kiriko Kamori is a caretaker of the Kanezaka shrine and a skilled ninja and healer. After the downfall of the Shimada, she vowed to protect her hometown from the deadly Hashimoto clan.",
        "role": "Support",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/088aff2153bdfa426984b1d5c912f6af0ab313f0865a81be0edd114e9a2f79f9.png"
    },
    {
        "name": "Moira",
        "description": "Equal parts brilliant and controversial, Moira is a scientist who wields the power of regrowth and decay. She stands on the cutting edge of genetic engineering, searching for a way to rewrite the fundamental building blocks of life.",
        "role": "Support",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/000beeb5606e01497897fa9210dd3b1e78e1159ebfd8afdc9e989047d7d3d08f.png"
    },
    {
        "name": "Sigma",
        "description": "Sigma is an eccentric and volatile astrophysicist who gained the power to control gravity in an orbital experiment gone wrong. Manipulated by Talon and deployed as a living weapon, Sigma’s presence on the battlefield cannot be ignored.",
        "role": "Tank",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/cd7a4c0a0df8924afb2c9f6df864ed040f20250440c36ca2eb634acf6609c5e4.png"
    },
    {
        "name": "Sojourn",
        "description": "A brilliant tactician and a fierce soldier, Vivian Chase--callsign ''Sojourn''--is an indispensable resource on any battlefield. Her cybernetic augmentations and railgun grant her the speed, precision, and firepower to sway the fight in her favor.",
        "role": "DPS",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/a53bf7ad9d2f33aaf9199a00989f86d4ba1f67c281ba550312c7d96e70fec4ea.png"
    },
    {
        "name": "Wrecking Ball",
        "description": "Hammond, the genetically-engineered hamster, rolls across the battlefield in his highly mobile Wrecking Ball mech. With an arsenal of weapons and the power of momentum, he will crush any enemies who get in his way",
        "role": "Tank",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/5c18e39ce567ee8a84078f775b9f76a2ba891de601c059a3d2b46b61ae4afb42.png"
    },
    {
        "name": "Ramattra",
        "description": "The brutal leader of Null Sector will stop at nothing to see his vision for the world realized.",
        "role": "Tank",
        "image": "https://d15f34w2p8l1cc.cloudfront.net/overwatch/3e0367155e1940a24da076c6f1f065aacede88dbc323631491aa0cd5a51e0b66.png"
    }
]